app/views/customers/time_line/show.html.haml

SELECT  1 AS one FROM "timelines"  WHERE (activity_type in ('BodyAssessment','DentalAssessment','VisionAssessment','HealthAssessment') OR assessment_activity_id = '0') AND "timelines"."customer_id" = $1 LIMIT 1  [["customer_id", 1]]
SELECT "timelines".* FROM "timelines"  WHERE (activity_type in ('BodyAssessment','DentalAssessment','VisionAssessment','HealthAssessment') OR assessment_activity_id = '0') AND "timelines"."customer_id" = $1  ORDER BY updated_at DESC  [["customer_id", 1]]
---
    %section.scrollable.wrapper
      - if session[:current_online_customer].timeline_activities.empty?