app/controllers/customers/allergies_controller.rb

  def index
    @customer_profile_page = true

    customer_id = session[:current_online_customer].id
    @customer = Customer.find(customer_id)
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = 1  ORDER BY created_at DESC LIMIT 1