app/controllers/customers/customer_information_controller.rb

  def get_message_prompts
    @customer=session[:current_online_customer]
    @gender=@customer.gender
    @risk_factors=Hash.new
    RiskFactor.all.each do |risk_factor|
      @message_prompt=Hash.new
      risk_factor.message_prompts.where(gender: @gender).all.each do |message_prompt|
---
SELECT "risk_factors".* FROM "risk_factors"
SELECT "message_prompts".* FROM "message_prompts"  WHERE "message_prompts"."risk_factor_id" = $1 AND "message_prompts"."gender" = 'Male'  [["risk_factor_id", 1]]