app/controllers/customers/dashboard_controller.rb

  def show
    current_online_customer = Customer.find_by(id: "2")
    customer = current_online_customer
    @diabetic_score=customer.diabetic_score
    @hypertension_score=customer.hypertension_score(1).round(3)
    @hypertension_percentage=(@hypertension_score*100).round
    @medical_conditions=MedicalCondition.all
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."customer_id" = 2  ORDER BY created_at DESC LIMIT 1
SELECT "medical_conditions".* FROM "medical_conditions"