app/controllers/customers/family_medical_histories_controller.rb

  def index
    @customer_profile_page = true

    @customer = current_online_customer
    @family_medical_histories = @customer.family_medical_histories
    @medical_conditions = MedicalCondition.all
---
SELECT "medical_conditions".* FROM "medical_conditions"