app/controllers/customers/health_assessments_controller.rb

SELECT "health_assessments".* FROM "health_assessments"  WHERE "health_assessments"."customer_id" = $1 AND "health_assessments"."type" = 'BodyAssessment'  ORDER BY request_date DESC, id DESC  [["customer_id", 1]]
SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = 1  ORDER BY created_at DESC LIMIT 1
SELECT  "health_assessments".* FROM "health_assessments"  WHERE "health_assessments"."id" = $1  ORDER BY request_date DESC, id DESC LIMIT 1  [["id", 2]]
---
  def index
    @customer_health_assessment = true
    @id, @type ,@inbox_id= params[:id], params[:type],params[:inbox_id]
    @assessment_class='assessments'
    @assessment_id=''

    unless(@inbox_id.nil?)
      @inbox=Inbox.find(@inbox_id)
      @inbox.update(status:true)
    end
    # @comments = DoctorComment.includes(:note).where(customer_id: session[:current_online_customer].id).all
    if @type == 'Body'
      @body_assessments = session[:current_online_customer].health_assessments.body_assessment_done
      if @body_assessments.first
        @comments = DoctorComment.select("health_assessment_id, description, doctor_name, doctor_comments.created_at").joins("inner join notes on notes.id=doctor_comments.notes_id where doctor_comments.customer_id=#{session[:current_online_customer].id} and health_assessment_id=#{@body_assessments.first.id} order by doctor_comments.created_at DESC")
        @body_assessment = HealthAssessment.find(@body_assessments.first.id)

SELECT  "inboxes".* FROM "inboxes"  WHERE "inboxes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "inboxes" SET "status" = $1, "updated_at" = $2 WHERE "inboxes"."id" = 1  [["status", "t"], ["updated_at", "2015-04-23 16:17:34.581294"]]
SELECT "health_assessments".* FROM "health_assessments"  WHERE "health_assessments"."customer_id" = $1 AND "health_assessments"."type" = 'BodyAssessment'  ORDER BY request_date DESC, id DESC  [["customer_id", 1]]
---
  def show
    @customer_health_assessment = true
    @assessment_class='assessment'
    @id, @type ,@inbox_id= params[:id], params[:type],params[:inbox_id]
    @assessment_id=@id
    unless(@inbox_id.nil?)
      @inbox=Inbox.find(@inbox_id)
      @inbox.update(status:true)
    end
    @comments = DoctorComment.select("health_assessment_id, description, doctor_name, doctor_comments.created_at").joins("inner join notes on notes.id=doctor_comments.notes_id where doctor_comments.customer_id=#{session[:current_online_customer].id} and health_assessment_id=#{@id} order by doctor_comments.created_at DESC")
    if @type.downcase == 'body'
      @body_assessments = session[:current_online_customer].health_assessments.body_assessment_done
      @body_assessment = HealthAssessment.find(@id)