app/controllers/customers/medications_controller.rb

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = 1  ORDER BY created_at DESC LIMIT 1
---
  def index
    @customer_profile_page = true
    customer_id = current_online_customer.id
    @customer = Customer.find(customer_id)