app/controllers/customers/otp_controller.rb

  def generate_otp
    @resource = Customer.find_by(mobile_number: params[:mobile_number])
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."mobile_number" = '9502859660'  ORDER BY created_at DESC LIMIT 1