app/controllers/customers/registrations_controller.rb

            expire_data_after_sign_in!
            respond_with resource, location: after_inactive_sign_up_path_for(resource)
          end
          CustomerVitals.create(customer_id: resource.id)
---
INSERT INTO "customer_vitals" ("created_at", "customer_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-04-24 09:50:45.207337"], ["customer_id", 2], ["updated_at", "2015-04-24 09:50:45.207337"]]
INSERT INTO "customers" ("created_at", "date_of_birth", "email", "encrypted_password", "first_name", "gender", "last_name", "mobile_number", "otp_secret_key", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

          result = Net::HTTP.get(URI.parse(URI.encode('http://alerts.sinfini.com/api/web2sms.php?workingkey=A3b834972107faae06b47a5c547651f81&to='+ resource.mobile_number() +'&sender=EKCARE&message=Dear '+ resource.first_name() +', DOWNLOAD FREE EKINCARE APP, to digitize your physical medical records. Click http://bit.ly/eKgoogle for ANDROID or click http://bit.ly/eKapple for Apple iPhone')))

          # need to assign coupon as per requirement
          coupon=Coupon.all.first
---
SELECT  "coupons".* FROM "coupons"   ORDER BY "coupons"."id" ASC LIMIT 1