app/controllers/customers/sessions_controller.rb

SELECT  "customers".* FROM "customers"  WHERE "customers"."mobile_number" = '9502859660'  ORDER BY created_at DESC LIMIT 1
---
  def create
    session[:is_customer] = true
    self.resource = Customer.find_by(mobile_number: params[:online_customer][:mobile_number])