app/controllers/staff/health_assessments/lab_tests_controller.rb

SELECT "lab_tests".* FROM "lab_tests"  WHERE "lab_tests"."enterprise_id" IS NULL
---
  def index
    @lab_tests = LabTest.where(enterprise_id: params[:enterprise_id])