app/views/customers/dashboard/show.html.haml

SELECT "blood_groups".* FROM "blood_groups"
---
                          var customer_blood_type={};
                      - BloodGroup.all.each do |blood_group|

SELECT "medical_conditions".* FROM "medical_conditions"
---
                      .ekin-choices
                        -MedicalCondition.all.each do |medical_condition|

SELECT  "enterprises".* FROM "enterprises"  WHERE "enterprises"."enterprise_id" = 'EK' LIMIT 1
SELECT  "lab_tests".* FROM "lab_tests"  WHERE "lab_tests"."name" = 'Blood Glucose' AND "lab_tests"."enterprise_id" = 1 LIMIT 1
SELECT  "test_components".* FROM "test_components"  WHERE (lower(name) = 'diastolic' and enterprise_id =1)  ORDER BY "test_components"."id" ASC LIMIT 1
---
                - if session[:current_online_customer].recent_body_assessment
                  - LabTest.find_by(name: "Blood Glucose", enterprise_id: "#{session[:current_online_customer].recent_body_assessment.enterprise_id ? session[:current_online_customer].recent_body_assessment.enterprise_id : Enterprise.find_by_enterprise_id('EK').id}").test_components.each do |test_component|

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = 2  ORDER BY created_at DESC LIMIT 1
---
      - if current_online_customer.id == session[:current_online_customer].id
        - Customer.where("guardian_id = " + session[:current_online_customer].id.to_s).each do |customer|

SELECT  "lab_results".* FROM "lab_results"  WHERE (test_component_id IN (28,29) AND body_assessment_id=2)  ORDER BY updated_at DESC LIMIT 1
---
          - index = -1
          - family_member.insufficient_results.each do |test_name, test_components|

SELECT "health_assessments".* FROM "health_assessments"  WHERE "health_assessments"."customer_id" = $1 AND (assessment_type = 'Body' AND status = 'done')  ORDER BY request_date DESC, id DESC, request_date DESC  [["customer_id", 1]]
---
                    -unless comment.health_assessment_id.nil?
                      - assessment = HealthAssessment.find(comment.health_assessment_id) ? HealthAssessment.find(comment.health_assessment_id) : nil