app/views/customers/health_assessments/body_assessment.html.haml

SELECT  "inboxes".* FROM "inboxes"  WHERE "inboxes"."associated_id" = 2 LIMIT 1
---
              %li.list-group-item{id:body_assessment.id,class: (@assessment_id.to_s==body_assessment.id.to_s)? 'current_assessment': '',}
                -inbox_id=Inbox.find_by_associated_id(body_assessment.id)

SELECT  "test_components".* FROM "test_components"  WHERE (lower(name) = 'average blood glucose(abg)' and enterprise_id =1)  ORDER BY "test_components"."id" ASC LIMIT 1
---
                - if @body_assessment
                  - if @body_assessment.categorize_components.nil? || @body_assessment.categorize_components.empty?

SELECT  "test_components".* FROM "test_components"  WHERE "test_components"."name" = 'Average Blood Glucose(ABG)' LIMIT 1
---
                  -else
                    -@body_assessment.categorize_components.each do |lab_test_name, test_components|

SELECT  "enterprises".* FROM "enterprises"  WHERE "enterprises"."enterprise_id" = 'EK' LIMIT 1
SELECT  "lab_tests".* FROM "lab_tests"  WHERE "lab_tests"."name" = 'Blood Glucose' AND "lab_tests"."enterprise_id" = 1 LIMIT 1
---
                                -unless @body_assessment.appointments.empty? || @body_assessment.appointments.nil?
                                  -unless(@body_assessment.appointments.first.get_enterprise_id.nil?)
                                    - enterprise_id =@body_assessment.appointments.first.get_enterprise_id
                                    = LabTest.find_by(name: lab_test_name, enterprise_id: enterprise_id).info

SELECT "lab_results".* FROM "lab_results"  WHERE "lab_results"."body_assessment_id" = $1  ORDER BY updated_at DESC  [["body_assessment_id", 2]]
---
                                    .rResult.col-sm-6.col-xs-7.pull-right{"data-percent" => "98"}
                                      -if session[:current_online_customer].resulted_component_value1(info[:test_component_diff][:name], info[:test_component_diff][:value], @body_assessment.id)[:color]=='text-warning'
                                        .rResultValue{:style => "left:40%;top:-44px"}
                                          .warning Warning
                                          .value

SELECT  "lab_tests".* FROM "lab_tests"  WHERE "lab_tests"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "test_components".* FROM "test_components"  WHERE "test_components"."id" = $1 LIMIT 1  [["id", 8]]
---
                                    .col-sm-6
                                      - test_component_id = LabResult.find(lab_result.id).test_component_id