app/controllers/staff/customers_controller.rb

SELECT  "customers".* FROM "customers"  WHERE "customers"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 0]]
---
  def show
    @customer = Customer.includes([:allergies, :immunizations, :health_assessments, :customer_allergies, :customer_immunizations, :medications, :family_medical_histories]).find(params[:id])