app/views/customers/profile/_normal_bio_details.html.haml

            = f.label 'Blood Group'
            = select_tag 'blood_group_id', options_for_select(BloodGroup.all.collect{|b| [b.blood_type, b.id]}.insert(0, 'select'), selected: @customer.customer_vitals.blood_group_id), {class: 'form-control parsley-validated'}
        .form-group
---
SELECT  "customer_vitals".* FROM "customer_vitals"  WHERE "customer_vitals"."customer_id" = $1 LIMIT 1  [["customer_id", 1]]
SELECT "blood_groups".* FROM "blood_groups"