app/views/customers/family_medical_histories/index.html.haml

SELECT "medical_conditions".* FROM "medical_conditions"
---
                        %td
                          -medical_history.medical_conditions.each do |medical_condition|